docs/benchmark-results/sync-vs-async/raw/stage3-async-batch100-k6-logs/insert-only-vu50.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load-test/large-db-insert-async.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 10m30s max duration (incl. graceful stop):
              * insert_async: 200 iterations for each of 50 VUs (maxDuration: 10m0s, gracefulStop: 30s)



  █ TOTAL RESULTS 

    HTTP
    http_req_duration..............: avg=1.42ms min=0s med=1ms max=21.39ms p(90)=3ms    p(95)=4.25ms
      { expected_response:true }...: avg=1.42ms min=0s med=1ms max=21.39ms p(90)=3ms    p(95)=4.25ms
    http_req_failed................: 0.00%  0 out of 10000
    http_reqs......................: 10000  24137.390024/s

    EXECUTION
    iteration_duration.............: avg=1.91ms min=0s med=1ms max=28.82ms p(90)=4.16ms p(95)=6.6ms 
    iterations.....................: 10000  24137.390024/s

    NETWORK
    data_received..................: 732 kB 1.8 MB/s
    data_sent......................: 1.4 MB 3.5 MB/s



running (00m00.4s), 00/50 VUs, 10000 complete and 0 interrupted iterations
insert_async ✓ [ 100% ] 50 VUs  00m00.4s/10m0s  10000/10000 iters, 200 per VU